{
  "name": "Fabio Gariglio",
  "role": "Engineering Manager",
  "summary": "Result driven Technology Leader with over 14 years of experience in building scalable enterprise systems and growing high performance engineering teams. Responsible for the payments, fraud prevention and multi-currency services of the world's leading independent rail and coach travel platform.",
  "experiences": [
      {
          "title": "Engineering Manager",
          "company": "trainline",
          "city": "London",
          "country": "United Kingdom",
          "from": "2020-09-01",
          "description": "Leading with empathy 8-10 high performing engineers while promoting a culture of technical excellence, ownership, teamwork and self-improvement./nSupporting, mentoring and coaching team leaders through regular 1:1s providing continuous and immediate feedback./nOverseeing the payments, fraud prevention and currency conversion functions. Liaising with major stakeholders such as Security, Architecture and Platform Reliability teams./nCreating new teams aligned to business functions taking into account individual skills and objectives./nCoaching engineers on planning and delivering effectively large initiatives that have intricate dependencies and tight deadlines./nProviding input and collaborating with engineering team leads to define a quarterly technical roadmap that delivers innovation and business value; facilitating the negotiation with product owner."
      },    
      {
          "title": "Engineering Team Lead",
          "company": "trainline",
          "city": "London",
          "country": "United Kingdom",
          "from": "2018-04-01",
          "to": "2020-09-01",
          "description": "Team and tech leader for Trainline's payments, fraud and multi-currency microservices architecture in terms of design, scalability and compliance to PCI-DSS./nResponsible to adopt Enterprise Software Patterns to guarantee platform stability under heavy load and infrastructure failures./nEnsuring new platform capabilities are explored, designed and documented to provide accurate estimates to the business and clear plans for the team to develop./nShaping the team culture to foster practices and behaviors in order to reduce technical debt and streamline development process."
      },    
      {
          "title": "Senior Software Engineer",
          "company": "trainline",
          "city": "London",
          "country": "United Kingdom",
          "from": "2017-04-01",
          "to": "2018-04-01",
          "description": "Team and tech leader for Trainline's payments, fraud and multicurrency microservices architecture in terms of design, scalability and PCI compliance.\nInvolved in cross-team architecture design.\nSpeeding development process up defining best practices.\nPlaying Scrum Master role to ensure agile practices are understood and applied effectively.\nMentoring less experienced member of my and other teams.\nInterviewing candidates for the engineering teams and improving current recruitment process."
      },
      {
        "title": "Agile Software Developer",
        "company": "trainline",
        "city": "London",
        "country": "United Kingdom",
        "from": "2015-09-01",
        "to": "2017-04-01",
        "description": "Development of payment microservices based on RESTful HATEOAS APIs.\nContinuous development approach to deploy live components minimizing risks and speeding up feature release.\nDevOps culture to ensure services reliability, cost reduction and performances accountability.\nMetrics and logs analysis to spot potential issues and platform behaviors in advance.\nDefining cross team integration strategies.\nDevelopment of Environment Manager: Trainline’s continuous delivery platform that enabled the company to completely migrate hundreds of microservices to AWS in within 12 months.\nProduction of several AWS Lambdas for cloud costs optimization and operation auditing\nIntegration with AWS products APIs (DynamoDB, EC2, S3, ELB, SNS, SQS and IAM) for large cloud infrastructure management."
    },
    {
        "title": "Agile Software Developer",
        "company": "deltatre",
        "city": "Turin",
        "country": "Italy",
        "from": "2013-12-09",
        "to": "2015-07-31",
        "description": "Development of a dynamic web framework on top of ASP.NET MVC for high traffic websites.\nDevelopment of an AngularJS web application for real-time editorial collaboration and content editing using SignalR.\nDevelopment of a scalable event-based cloud-first infrastructure for editorial content management and distribution.\nMastering Event Sourcing, CQRS and DDD patterns.\nExtensive integration with CDN systems and distributed data cache.\n Actively member of an Agile Scrum team"
    },
    {
        "title": "Software Developer",
        "company": "deltatre",
        "city": "Turin",
        "country": "Italy",
        "from": "2012-04-23",
        "to": "2013-12-06",
        "description": "Development of a ASP.NET web application for editorial content management used by some of the world biggest associations and news agencies such as FIFA.com, Olympic games committee, channel 4, CBC. Committed to deliver projects against strict deadlines and providing on-site 1st level support during live events followed by tens of millions of users. Re-designed the third-party asynchronous feeds processor in optic for reusability cutting down the development cost by 2/3."
    },
    {
        "title": "Software Developer",
        "company": "Sistemi",
        "city": "Turin",
        "country": "Italy",
        "from": "2007-10-08",
        "to": "2012-04-20",
        "description": "Main developer of the off-line software used for the production, verification and transmission of the 770 tax form."
    }
  ],
  "certifications": [
    {
        "name": "Microsoft Certified Professional",
        "logo": "resume/microsoft-certified-professional.png",
        "from": "05/2010"
    },
    {
        "name": "Certified ScrumMaster®",
        "logo": "resume/certified-scrummaster.jpg",
        "from": "07/2017",
        "to": "07/2019"
    }    
  ],
  "skills": [
    {
        "name": "C# and JavaScript",
        "level": "Excellent"
    },
    {
        "name": "ASP.NET and NodeJS",
        "level": "Excellent"
    },
    {
        "name": "MVC, Rest API, OWIN, ExpressJS and AngularJS",
        "level": "Excellent"
    },
    {
        "name": "TDD, EventSourcing, CQRS and DDD",
        "level": "Excellent"
    },
    {
        "name": "Microservices, Continuous deployment and continuous integration",
        "level": "Excellent"
    },
    {
        "name": "AWS Lambda, EC2, DynamoDB, S3, SNS, SQS and IAM",
        "level": "Excellent"
    },
    {
        "name": "T-SQL and RabbitMQ",
        "level": "Excellent"
    },
    {
        "name": "NewRelic and ELK stack",
        "level": "Excellent"
    },
    {
        "name": "VB.NET, Azure ServiceBus and Graphite",
        "level": "Good"
    },
    {
        "name": "Docker and Linux OSs",
        "level": "Good"
    }
  ],
  "languages": [
      {
          "name": "English",
          "level": "Full professional"          
      },
      {
        "name": "Italian",
        "level": "Native or bilingual"          
    }      
  ],
  "contacts": [
      {
          "name": "email",
          "value": "garigliofabio@gmail.com"
      },
      {
          "name": "linkedin",
          "value": "https://www.linkedin.com/in/fabiogariglio"
      },
      {
          "name": "github",
          "value": "https://github.com/fabio-gariglio"
      }
  ]
}
